[
  {
    "deal": {
      "product_description": "The Refurb Unlocked Samsung Galaxy S23 Ultra 512GB Smartphone is a high-end mobile device featuring a 6.8 120Hz 1440x3088 display, Snapdragon 8 Gen 2 Processor, 8GB RAM, and 512GB storage. It has a 200MP main camera and a 12MP front camera, as well as a 5,000mAh battery. The phone comes with a 1-year Allstate warranty and has a model number of SM-S918U1. It is designed to provide a fast and seamless user experience, making it suitable for various tasks such as gaming, video watching, and productivity.",
      "price": 505.0,
      "url": "https://www.dealnews.com/products/Samsung/Unlocked-Samsung-Galaxy-S23-Ultra-512-GB-Smartphone/405671.html?iref=rss-c142"
    },
    "estimate": 902.2058823130669,
    "discount": 397.2058823130669
  },
  {
    "deal": {
      "product_description": "The Eco-Worthy 3,584Wh 12V 280Ah LiFePO4 Bluetooth Lithium Battery with Charger is a high-capacity battery that features advanced Bluetooth monitoring and a built-in BMS. The battery has a large capacity of 3,584Wh and is designed for use in a range of applications, including RVs, boats, and off-grid systems. It is also compatible with a range of devices and comes with a charger, making it easy to keep the battery topped up. The battery is a great choice for anyone looking for a reliable and high-capacity power source and is available at a discounted price. With its advanced features and high capacity, the Eco-Worthy 3,584Wh 12V 280Ah LiFePO4 Bluetooth Lithium Battery with Charger is a great choice for anyone looking to upgrade their power system.",
      "price": 374.0,
      "url": "https://www.dealnews.com/Eco-Worthy-3-584-Wh-12-V-280-Ah-Li-Fe-PO4-Bluetooth-Lithium-Battery-w-Charger-for-374-free-shipping/21735965.html?iref=rss-c142"
    },
    "estimate": 711.7651086312137,
    "discount": 337.7651086312137
  },
  {
    "deal": {
      "product_description": "The Eco-Worthy 1,920Wh 12V 150Ah LiFePO4 Lithium RV Home Bluetooth Battery is a high-capacity battery that features advanced lithium-ion technology and supports Bluetooth connectivity. It has a durable build and is designed for use in RVs and homes. The battery also comes with built-in BMS and low-temperature cut-off protection. It has a long-lasting lifespan and is maintenance-free. The battery is also compatible with a variety of devices and has a user-friendly interface. It supports wireless monitoring and has a built-in microphone and speaker.",
      "price": 169.99,
      "url": "https://www.dealnews.com/Eco-Worthy-1-920-Wh-12-V-150-Ah-Li-Fe-PO4-Lithium-RV-Home-Bluetooth-Battery-for-170-free-shipping/21735735.html?iref=rss-c142"
    },
    "estimate": 498.7854590219088,
    "discount": 328.7954590219088
  },
  {
    "deal": {
      "product_description": "The Insignia 75 Class F50 Series LED 4K UHD Smart Fire TV is a high-definition television that features a large 75-inch screen and 4K resolution. The TV has a native resolution of 3840 x 2160 pixels, providing users with a crisp and clear picture. It also features HDR10 and HLG, allowing for a wider range of colors and contrast. The TV is a smart device, featuring Alexa enabled Fire TV and access to popular streaming services such as Netflix, Disney+, and YouTube. The Insignia TV is perfect for users who want a high-quality viewing experience and access to a range of entertainment options.",
      "price": 380.0,
      "url": "https://www.dealnews.com/products/Insignia/Insignia-75-Class-F50-Series-LED-4-K-UHD-Smart-Fire-TV/486584.html?iref=rss-c142"
    },
    "estimate": 718.5321585252964,
    "discount": 338.5321585252964
  },
  {
    "deal": {
      "product_description": "The Unlocked Apple iPhone 14 128GB Smartphone is a high-end device that features a powerful processor, high-quality camera, and sleek design. It has a 6.1-inch screen and comes with 128GB of internal storage. The iPhone 14 also features advanced security features, including Face ID and Touch ID. Additionally, it is compatible with a wide range of accessories and has a long-lasting battery life. The device is also water and dust resistant, making it a great option for those who want a reliable and durable smartphone.",
      "price": 550.0,
      "url": "https://www.dealnews.com/Best-Buy-Apple-Deals-Up-to-100-off-free-shipping/21736797.html?iref=rss-c142"
    },
    "estimate": 760.9006651962259,
    "discount": 210.90066519622587
  },
  {
    "deal": {
      "product_description": "The Unlocked Samsung Galaxy S25 Ultra Android Phone is a high-end smartphone with advanced features and capabilities. It has a large storage capacity of up to 1TB, making it ideal for users who need to store a lot of data. The phone is also equipped with a powerful processor and a long-lasting battery, providing fast performance and extended usage times. With its sleek design and high-quality display, the Unlocked Samsung Galaxy S25 Ultra Android Phone is a great option for anyone who wants a premium smartphone experience. The phone is available in different storage options, including 512GB and 1TB, and can be purchased at a discounted price with a trade-in.",
      "price": 670.0,
      "url": "https://www.dealnews.com/Unlocked-Samsung-Galaxy-S25-Ultra-Android-Phones-512-GB-for-256-GB-price-up-to-630-w-trade-free-shipping/21737070.html?iref=rss-c142"
    },
    "estimate": 902.8042351435058,
    "discount": 232.80423514350582
  },
  {
    "deal": {
      "product_description": "The Bose SoundLink Flex SE Bluetooth Speaker is a waterproof and portable speaker that offers high-quality sound. It has a power output of 20 watts and is IP67 rated, making it suitable for outdoor use. The speaker is also rechargeable via USB-C and has a built-in battery that provides long-lasting playback. Additionally, it comes with the Bose Connect app, which allows users to customize their listening experience. This certified refurb item is backed by a two-year warranty from Allstate, providing peace of mind for buyers. With its compact design and durable construction, the Bose SoundLink Flex SE is a great option for those looking for a reliable and versatile Bluetooth speaker.",
      "price": 69.0,
      "url": "https://www.dealnews.com/products/Bose/Bose-Sound-Link-Flex-SE-Bluetooth-Speaker/489656.html?iref=rss-c142"
    },
    "estimate": 216.37935714845833,
    "discount": 147.37935714845833
  },
  {
    "deal": {
      "product_description": "The Samsung Galaxy Watch Ultra 47mm Smartwatch is a high-end smartwatch with advanced features and capabilities. It has a large and vibrant display, a powerful processor, and a long-lasting battery. The watch also has a range of health and fitness tracking features, including heart rate monitoring and GPS tracking. The Samsung Galaxy Watch Ultra 47mm Smartwatch is a great option for those who want a premium smartwatch experience with advanced features and capabilities. It is available for purchase with a price that is not explicitly stated, but it is mentioned that it can be up to $325 off with a trade.",
      "price": 0.0,
      "url": "https://www.dealnews.com/Samsung-Galaxy-Watch-Ultra-47-mm-Smartwatch-140-off-or-up-to-325-off-w-trade-free-shipping/21737085.html?iref=rss-c142"
    },
    "estimate": 362.8777867614906,
    "discount": 362.8777867614906
  }
]